      "description": "A classic gin cocktail created for the Twentieth Century Limited train, blending gin, Lillet Blanc and white creme de cacao with citrus for a silky, balanced drink.",
      "instructions": "Fill a shaker with ice.\\nAdd gin, Lillet Blanc, white creme de cacao and lime juice.\\nShake well and strain into a chilled coupe.\\nDust with cocoa powder and grate nutmeg on top.",
      "description": "An easy highball named for its two sevens: Seagram's 7 Crown whiskey topped with 7-Up for a light, refreshing drink.",
      "instructions": "Fill a Collins glass with ice.\\nPour in Seagram's 7 Crown.\\nTop with 7-Up and gently stir.\\nGarnish with a lemon wedge.",
      "description": "A tropical mix of tequila and white rum with pineapple and grapefruit juices, inspired by the Mexican resort city of Acapulco.",
      "instructions": "Fill a shaker with ice.\\nAdd tequila, white rum, pineapple juice, grapefruit juice, lime juice and simple syrup.\\nShake well and strain into a hurricane glass filled with fresh ice.",
      "description": "A low-proof sherry cocktail created in the 1880s to celebrate a Broadway show, blending dry sherry and sweet vermouth with orange bitters.",
      "instructions": "Add dry sherry, red vermouth and orange bitters to a mixing glass with ice.\\nStir until chilled and strain into a coupe.\\nGarnish with an orange twist.",
      "description": "An Italian aperitivo featuring Amaro Nonino and Aperol balanced with fresh orange juice.",
      "instructions": "Fill a shaker with ice.\\nAdd Amaro Nonino, Aperol and orange juice.\\nShake and strain into a cocktail glass.\\nGarnish with an orange slice.",
      "description": "A tequila-based riff on the classic Negroni, swapping gin for tequila while keeping vermouth and Campari.",
      "instructions": "Add tequila, red vermouth and Campari to a mixing glass with ice.\\nStir well and strain into a rocks glass over ice.\\nGarnish with an orange peel.",
    },
    {
      "description": "Also called \"Glühwein\" in German, this drink is very popular in German-speaking countries, France and Russia. Spices can be varied greatly – just use what you like.",
    },
    {
    },
    {
    },
    {
    },
    {
    },
    {
      "description": "A very mild and sweet cocktail that resembles oatmeal cookies. Some variations exclude Jägermeister from the recipe. The recipe here is for 3–4 shots.",
      "instructions": "Fill a shaker with ice cubes.\nAdd 30ml of Goldschläger and 30ml of butterscotch liqueur.\nAdd 30ml of Baileys and optionally 30ml of Jägermeister.\nShake well and strain into shooter glasses.",
          "name": "Goldschläger",
          "name": "Jägermeister",
    },
    {
    },
    {
    },
    {
    },
    {
      "description": "A variation of the \"Brandy Alexander\" with crème de cacao white instead of dark.",
      "instructions": "Fill a shaker with ice cubes.\nAdd 30ml of cognac, 30ml of crème de cacao white and 30ml of cream.\nShake well and strain into a cocktail glass.\nGarnish with grated nutmeg.",
    },
    {
    },
    {
    },
    {
    },
    {
    },
    {
    },
    {
    },
    {
    },
    {
    },
    {
    },
    {
