      "description": "Advocaat is a rich Dutch egg liqueur with sweet custard notes and 14–20% ABV. Try it in a Snowball or Bombardino.",
      "description": "Ale is a malty, fruity beer around 4–6% ABV. Enjoy it in a Shandy or Snakebite.",
      "description": "Amaretto is an Italian almond liqueur at 21–28% ABV with sweet, nutty flavor. Use it in an Amaretto Sour or Godfather.",
      "description": "Amaro Montenegro is a herbal Italian amaro from Bologna by Montenegro Srl., 23% ABV. Mix it in a Monte & Tonic or Paper Plane.",
      "description": "Amaro Nonino is a bittersweet amaro from Nonino Distillatori at 35% ABV. Ideal in a Paper Plane or Black Manhattan.",
      "description": "Anis is a sweet anise-flavored liqueur, typically 20–40% ABV. Try it in an Anisette Sour or Spanish coffee.",
      "description": "Aperol is a bright orange aperitif from Campari Group, 11% ABV, with bitter citrus and rhubarb notes. Perfect for an Aperol Spritz or Paper Plane.",
      "description": "Apfelkorn is a sweet German apple schnapps about 18% ABV. Sip it straight or mix in a hot apple cocktail.",
      "description": "Apple cider is a crisp fermented apple drink at 4–6% ABV. Enjoy it in a Snakebite or Stone Fence.",
      "description": "Apple liqueur is a sweet apple spirit around 15–30% ABV. Shake it into an Appletini or Applejack cocktail.",
      "description": "Apple schnapps is a tart apple spirit with roughly 15–25% ABV. Use it in an Apple Pie shot or Appletini.",
      "description": "Baileys Irish Cream is a creamy liqueur by Diageo, 17% ABV, with chocolate and whiskey notes. Serve in a Mudslide or B-52.",
      "description": "Banana liqueur is a sweet banana spirit about 20–25% ABV. Mix it in a Banana Daiquiri or Dirty Banana.",
      "description": "Beer is a carbonated malt beverage around 4–6% ABV with malty, hoppy notes. Pour it in a Michelada or Shandy.",
      "description": "Blackberry liqueur offers rich berry sweetness at about 18–20% ABV. Use it in a Bramble or Blackberry Martini.",
      "description": "Butterscotch liqueur is a sweet caramel spirit about 15% ABV. Works in a Butterball or Caramel Appletini.",
      "description": "Campari is a bitter orange aperitif by Campari Group, roughly 20–28% ABV. Essential in a Negroni or Americano.",
      "description": "Chestnut liqueur is nutty and sweet with 15–20% ABV. Try it in a Mont Blanc or Autumn cocktail.",
      "description": "Dark crème de cacao is a chocolate liqueur around 20–25% ABV. Mix it in a Brandy Alexander or Grasshopper.",
      "description": "White crème de cacao is a clear cocoa liqueur around 20–25% ABV. Ideal in a Grasshopper or Alexander.",
      "description": "Green crème de menthe is a mint liqueur about 25% ABV. Use it in a Grasshopper or Stinger.",
      "description": "White crème de menthe is a clear mint liqueur about 25% ABV. Try it in a Stinger or Grasshopper.",
      "description": "Crème de violette is a floral violet liqueur at 16–20% ABV. Classic in an Aviation or Blue Moon.",
      "description": "Cynar is an artichoke-based Italian amaro by Campari Group, 16.5% ABV. Mix it in a Cynar Spritz or Bitter Giuseppe.",
      "description": "Egg liqueur is a creamy egg-based spirit at 14–20% ABV. Sip it in a Snowball or Dutch Coffee.",
      "description": "Gran Classico is a Swiss bitter aperitivo by Tempus Fugit, 28% ABV. Try it in a Negroni or Spritz.",
      "description": "Hazelnut liqueur is sweet and nutty, around 20% ABV. Use it in a Nutty Russian or Chocolatini.",
      "description": "Hpnotiq is a blue tropical liqueur by Heaven Hill, 17% ABV, with passion fruit and citrus. Mix it in an Incredible Hulk or Hpnotiq Breeze.",
      "description": "Irish stout is a dark roasted beer at 4–5% ABV with creamy malt. Try it in a Black Velvet or Irish Car Bomb.",
      "description": "Limoncello is a zesty Italian lemon liqueur at 25–30% ABV. Serve it in a Lemon Drop or Amalfi Spritz.",
      "description": "Midori is a neon-green Japanese melon liqueur by Suntory, 20% ABV. Use it in a Midori Sour or Japanese Slipper.",
      "description": "Orange curaçao is an orange liqueur at 20–40% ABV with bittersweet citrus. Essential in a Mai Tai or Sidecar.",
      "description": "Orange liqueur adds citrus sweetness at roughly 20–40% ABV. Try it in a Margarita or Cosmopolitan.",
      "description": "Peach liqueur is a sweet stone-fruit spirit around 20% ABV. Delicious in a Bellini or Sex on the Beach.",
      "description": "Pimm's No. 1 is a gin-based fruit cup by Diageo, 25% ABV. Classic in a Pimm's Cup or Summer Cup.",
      "description": "Sparkling wine is effervescent wine about 11–13% ABV. Enjoy it in a Mimosa or Bellini.",
}
